---
kind: method
id: M:Autodesk.Revit.DB.Lighting.InitialWattageIntensity.#ctor(Autodesk.Revit.DB.Lighting.InitialWattageIntensity)
source: html/f188f892-88b2-28d7-ab54-8c57b447dbdf.htm
---
# Autodesk.Revit.DB.Lighting.InitialWattageIntensity.#ctor Method

Creates a copy of the given initial wattage intensity object

## Syntax (C#)
```csharp
public InitialWattageIntensity(
	InitialWattageIntensity other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Lighting.InitialWattageIntensity`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null